workshop1/shockTube/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat       raw;

fields          (T mag(U) p);

setConfig
{
    type        uniform;   // midPoint, midPointAndFace
    axis        x;  // x, y, z, xyz
    nPoints     1000;
}

sets
(
    data
    {
        $setConfig;
        start   (-5 0 0);
        end     (5 0 0);
    }
);

// ************************************************************************* //
